---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ParameterDownloadOptions Constructor
ParameterDownloadOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ParameterDownloadOptions()()()() | Default constructor. |
|  | ParameterDownloadOptions(ISet<(Of <<'(ElementId>)>>), Boolean, Boolean, ForgeTypeId) | Creates a new ParameterDownloadOptions instance. Category bindings are represented by an ElementIdSet populated with category identifiers. |

# See Also

ParameterDownloadOptions Class

ParameterDownloadOptions Members

Autodesk.Revit.DB Namespace